namespace ConsoleApp1
{
    public class Empty
    {
        // Список "косяков"
        // 1. Везде где можно в блоке РидерВрайтерЛокСлим я вызвал ИнтерлокедИнкремент - исправил(наверное)
        // 2. Не написал метод который проверял "а сделан ли Диспоз ?"
        // 3. Мой метод для ЛИНКЪЮ написан оч топорно, только потом понял, что если будет ошибка 
        //    то вылезет она непонятно где - буду переписывать
        // 4. Метод валидации имени оч строгий, переписал - теперь имя "Д`Артаньян" прокатывает
        // 5. Назвал класс с атрибутом атрибутом - астрологи объявили удвоеное кол-во слов Attribute - исправил
        // 6. ГрамМатическая ошибка в слове журнал(написал с одной г) - исправил
        // 7. Джемини  : если что то не получилось не возвращай ошибку (а такая прикольная штука эти ваши исключения)
        //    - говорит верни ссылку на объект, а метод пусть вернет тру или фолсе, сделал,
        //    а он - ща модно возвращать кортеж - оставлю без коментариев
        // 8. Конструкция РидерВрайтерЛокСлим подозрительно напоминает синтСахар lock(stub) если его развернуть
        //    (ток сейчас понял, поэтому интерлокед во внутрь не совать) (конструкция с классом Монитор)
    }
}